app/views/friend_circles/_form.html.erb

SELECT "users".* FROM "users"
---
  <br>
  <% User.all.each do |user| %>