app/views/friend_circles/show.html.erb

<ul>
  <% @friend_circle.friend_circle_memberships.each do |member| %>
---
SELECT "friend_circle_memberships".* FROM "friend_circle_memberships" WHERE "friend_circle_memberships"."friend_circle_id" = 3