app/views/users/show.html.erb

SELECT "friend_circles".* FROM "friend_circles" WHERE "friend_circles"."user_id" = 1
---
<ul>
<% @user.friend_circles.each do |friend_circle| %>