app/views/posts/feed.html.erb

<ul>
  <% post.links.each do |link| %>
---
SELECT "links".* FROM "links" WHERE "links"."post_id" = 8