app/views/posts/new.html.erb

  Select Circles to Share This Post With:
  <% current_user.friend_circles.each do |friend_circle| %>
---
SELECT "friend_circles".* FROM "friend_circles" WHERE "friend_circles"."user_id" = 1