app/views/posts/show.html.erb

<ul>
<% @post.links.each do |link| %>
---
SELECT "links".* FROM "links" WHERE "links"."post_id" = 1