app/controllers/friend_circles_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
---
  def new
    @user = User.find_by_id(params[:user_id])

INSERT INTO "friend_circles" ("created_at", "name", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Tue, 17 Dec 2013 18:29:57 UTC +00:00], ["name", "testcircl"], ["updated_at", Tue, 17 Dec 2013 18:29:57 UTC +00:00], ["user_id", 1]]
---
  def create
    @friend_circle = FriendCircle.new(params[:friend_circle])
    if @friend_circle.save

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "friend_circles".* FROM "friend_circles" WHERE "friend_circles"."id" = 2 LIMIT 1
---
  def edit
    @user = User.find_by_id(params[:user_id])
    @friend_circle = FriendCircle.find_by_id(params[:id])

SELECT "friend_circles".* FROM "friend_circles" WHERE "friend_circles"."id" = 1 LIMIT 1
UPDATE "friend_circles" SET "name" = 'Test changed circle', "updated_at" = '2013-12-17 23:02:59.950875' WHERE "friend_circles"."id" = 1
---
  def update
    @friend_circle = FriendCircle.find_by_id(params[:id])
    if @friend_circle.update_attributes(params[:friend_circle])

SELECT "friend_circles".* FROM "friend_circles" WHERE "friend_circles"."id" = 3 LIMIT 1
DELETE FROM "friend_circles" WHERE "friend_circles"."id" = $1  [["id", 3]]
---
  def destroy
    @friend_circle = FriendCircle.find_by_id(params[:id])
    @user = @friend_circle.user
    @friend_circle.destroy

SELECT "friend_circles".* FROM "friend_circles" WHERE "friend_circles"."id" = 3 LIMIT 1
---
  def show
    @friend_circle = FriendCircle.find_by_id(params[:id])