app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])
    @links = params[:posts][:links_attributes].values.delete_if do |link|
      link["title"] == "" && link["url"] == ""
    end
    @post.links.build(@links)
    if @post.save
---
INSERT INTO "links" ("created_at", "post_id", "title", "updated_at", "url") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Wed, 18 Dec 2013 00:31:59 UTC +00:00], ["post_id", 3], ["title", "c"], ["updated_at", Wed, 18 Dec 2013 00:31:59 UTC +00:00], ["url", "d"]]
INSERT INTO "posts" ("body", "created_at", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "body"], ["created_at", Tue, 17 Dec 2013 23:59:35 UTC +00:00], ["title", "title"], ["updated_at", Tue, 17 Dec 2013 23:59:35 UTC +00:00], ["user_id", 1]]

  def destroy
    @post = Post.find_by_id(params[:id])
    @post.destroy
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = 1 LIMIT 1
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 1]]

  def feed
    @posts = []
    current_user.friend_circle_memberships.each do |membership|
---
SELECT "friend_circle_memberships".* FROM "friend_circle_memberships" WHERE "friend_circle_memberships"."user_id" = 5