app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("created_at", "email", "password_digest", "pw_reset_token", "session_token", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"